Revit 2026 API

# CityName Property

---

The name of the city

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string Name { get; }
```
```vb
Public ReadOnly Property Name As String
	Get
```
```cpp
public:
property String^ Name {
	String^ get ();
}
```
```fsharp
member Name : string with get
```

#### Property Value

String

A read only string property that contains the name of the city, such as Boston.

#### Reference

City Class

Autodesk.Revit.DB Namespace